[
    {"year": 1933, "event": "Around 200,000 Viennese live in municipal flats."},
    {"year": 1939, "event": "Austrofascism and National Socialism bring construction activities to a standstill."},
    {"year": 1945, "event": "Destroyed dwellings: 87,000 dwellings are destroyed; around 35,000 persons are homeless."},
    {"year": 1947, "event": "Construction of Per-Albin-Hansson-Siedlung West with 1,033 flats."},
    {"year": 1950, "event": "The City of Vienna adopts a rapid-relief construction programme, predominantly with small “duplex units”, which could be combined into one bigger flat at a later date."},
    {"year": 1951, "event": "The 100,000th municipal flat is completed."},
    {"year": 1954, "event": "The Housing Promotion Act enters into force."},
    {"year": 1960, "event": "Urban expansion: An average of 9,000 new municipal flats is built every year."},
    {"year": 1966, "event": "Beginning of construction works for Per-Albin-Hansson-Siedlung East with over 5,000 flats."},
    {"year": 1969, "event": "The 10,000th flat after the end of the Second World War is completed."},
    {"year": 1971, "event": "Completion of Großfeldsiedlung development with 5,533 flats."},
    {"year": 1975, "event": "Completion of Am Schöpfwerk housing estate with 990 flats."},
    {"year": 1980, "event": "Retrofitting of the 1,000th lift in a municipal housing estate."},
    {"year": 1981, "event": "The 200,000th municipal flat is completed."},
    {"year": 1982, "event": "The new tenancy law and the Vienna housing promotion regulations enter into force."},
    {"year": 1984, "event": "The Vienna Land Procurement and Urban Renewal Fund is set up. Every year, around 10,000 flats are rehabilitated."},
    {"year": 1989, "event": "The Vienna Housing Promotion and Housing Rehabilitation Act enters into force. The Iron Curtain is dismantled, leading to mass immigration from the neighbouring countries east of Austria."},
    {"year": 1990, "event": "A new housing construction campaign is launched. The City of Vienna subsidises up to 10,000 new flats per year."},
    {"year": 1994, "event": "Amendment of tenancy law."},
    {"year": 1995, "event": "Both developers’ competitions and the Land Advisory Board are introduced."},
    {"year": 2000, "event": "Wohnservice Wien is established. The thermal rehabilitation programme “THEWOSAN” is launched."},
    {"year": 2004, "event": "The last municipal housing estate in Rösslergasse is completed."},
    {"year": 2010, "event": "The new neighbourhood service wohnpartner takes up its activities in Vienna’s municipal housing estates."},
    {"year": 2012, "event": "Launch of SMART housing construction programme."},
    {"year": 2015, "event": "The City of Vienna adopts the new construction programme “Municipal Housing NEW”."},
    {"year": 2019, "event": "The first project of the “Municipal Housing NEW” programme is taken over by its tenants."},
    {"year": 2020, "event": "21 municipal housing projects are in the planning or construction phase and due for completion by 2026."}
  ]
  